       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARIMPAR.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NUMERO           PIC 9(3).
       77 CONTADOR         PIC 9(3) VALUE 1.
       77 RESTO            PIC 9.
       77 RESULTADO        PIC X(15).

       PROCEDURE DIVISION.
       DISPLAY "DIGITE UM NUMERO INTEIRO: ".
       ACCEPT NUMERO.

       COMPUTE RESTO = NUMERO MOD 2.

       IF RESTO = 0
           MOVE "O NUMERO E PAR" TO RESULTADO
       ELSE
           MOVE "O NUMERO E IMPAR" TO RESULTADO
       END-IF.

       DISPLAY RESULTADO.
       DISPLAY "CONTANDO ATE " NUMERO ":".

       PERFORM UNTIL CONTADOR > NUMERO
           DISPLAY CONTADOR
           ADD 1 TO CONTADOR
       END-PERFORM.

       STOP RUN.